zephyrproject-rtos/zephyr/drivers/i2c/i2c_stm32_common.c
/*
 * Copyright (c) 2016 BayLibre, SAS
 * Copyright (c) 2017 Linaro Ltd
 * Copyright (c) 2024 Intel Corporation
 * Copyright (c) 2025 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/cache.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/i2c/rtio.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/logging/log.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/pm/policy.h>

#include <stm32_cache.h>
#include <stm32_ll_i2c.h>

#include "i2c_bitbang.h"
#include "i2c-priv.h"

LOG_MODULE_REGISTER(i2c_ll_stm32_common, CONFIG_I2C_LOG_LEVEL);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_i2c_v2)
#define DT_DRV_COMPAT st_stm32_i2c_v2
#else
#define DT_DRV_COMPAT st_stm32_i2c_v1
#endif

#include "i2c_stm32.h"

#ifdef CONFIG_I2C_STM32_V2_DMA
bool i2c_stm32_xfer_will_use_dma(const struct i2c_stm32_config *cfg, void *buf, size_t len, bool tx)
{
	uintptr_t dest_addr = (uintptr_t)buf;

	if (tx) {
		if (cfg->tx_dma.dev_dma == NULL) {
			return false;
		}

		if (stm32_buf_in_nocache(dest_addr, len)) {
			return true;
		}

		return sys_cache_data_flush_range(buf, len) == 0;
	}

	if (cfg->rx_dma.dev_dma == NULL) {
		return false;
	}

	if (stm32_buf_in_nocache(dest_addr, len)) {
		return true;
	}

#if defined(CONFIG_CACHE_MANAGEMENT) && defined(CONFIG_DCACHE)
	if (((dest_addr | len) % CONFIG_DCACHE_LINE_SIZE) == 0) {
		return true;
	}
#endif /* CONFIG_CACHE_MANAGEMENT && CONFIG_DCACHE */

	return false;
}
#endif /* CONFIG_I2C_STM32_V2_DMA */

#ifdef CONFIG_I2C_STM32_COMBINED_INTERRUPT
void i2c_stm32_combined_isr(void *arg)
{
	const struct device *dev = (const struct device *) arg;

	if (i2c_stm32_error(dev)) {
		return;
	}
	i2c_stm32_event(dev);
}
#else
void i2c_stm32_event_isr(void *arg)
{
	const struct device *dev = (const struct device *) arg;

	i2c_stm32_event(dev);
}

void i2c_stm32_error_isr(void *arg)
{
	const struct device *dev = (const struct device *) arg;

	(void)i2c_stm32_error(dev);
}
#endif

int i2c_stm32_activate(const struct device *dev)
{
	int ret;
	const struct i2c_stm32_config *cfg = dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	/* Move pins to active/default state */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("I2C pinctrl setup failed (%d)", ret);
		return ret;
	}

	/* Enable device clock. */
	if (clock_control_on(clk,
			     (clock_control_subsys_t) &cfg->pclken[0]) != 0) {
		LOG_ERR("i2c: failure enabling clock");
		return -EIO;
	}

	return 0;
}

#ifdef CONFIG_PM_DEVICE
int i2c_stm32_suspend(const struct device *dev)
{
	int ret;
	const struct i2c_stm32_config *cfg = dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	/* Disable device clock. */
	ret = clock_control_off(clk, (clock_control_subsys_t)&cfg->pclken[0]);
	if (ret < 0) {
		LOG_ERR("failure disabling I2C clock");
		return ret;
	}

	/* Move pins to sleep state */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_SLEEP);
	if (ret == -ENOENT) {
		/* Warn but don't block suspend */
		LOG_WRN("I2C pinctrl sleep state not available ");
	} else if (ret < 0) {
		return ret;
	}

	return 0;
}

int i2c_stm32_pm_action(const struct device *dev, enum pm_device_action action)
{
	int err;

	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		err = i2c_stm32_activate(dev);
		break;
	case PM_DEVICE_ACTION_SUSPEND:
		err = i2c_stm32_suspend(dev);
		break;
	default:
		return -ENOTSUP;
	}

	return err;
}
#endif

int i2c_stm32_pm_get(const struct device *dev)
{
	int ret;

	ret = pm_device_runtime_get(dev);
	if (ret == 0) {
		/* Prevent the clocks to be stopped during the i2c transaction */
		pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		if (IS_ENABLED(CONFIG_PM_S2RAM)) {
			pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_RAM, PM_ALL_SUBSTATES);
		}
	}

	return ret;
}

void i2c_stm32_pm_put(const struct device *dev)
{
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	if (IS_ENABLED(CONFIG_PM_S2RAM)) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_RAM, PM_ALL_SUBSTATES);
	}
	(void)pm_device_runtime_put(dev);
}

int i2c_stm32_runtime_configure(const struct device *dev, uint32_t config)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	I2C_TypeDef *i2c = cfg->i2c;
	uint32_t i2c_clock = 0U;
	int ret;

	if (cfg->pclk_len > 1) {
		if (clock_control_get_rate(clk, (clock_control_subsys_t)&cfg->pclken[1],
					   &i2c_clock) < 0) {
			LOG_ERR("Failed call clock_control_get_rate(pclken[1])");
			return -EIO;
		}
	} else {
		if (clock_control_get_rate(clk, (clock_control_subsys_t)&cfg->pclken[0],
					   &i2c_clock) < 0) {
			LOG_ERR("Failed call clock_control_get_rate(pclken[0])");
			return -EIO;
		}
	}

	data->dev_config = config;

#ifdef CONFIG_PM_DEVICE_RUNTIME
	ret = clock_control_on(clk, (clock_control_subsys_t)&cfg->pclken[0]);
	if (ret < 0) {
		LOG_ERR("failure Enabling I2C clock");
		return ret;
	}
#endif

	LL_I2C_Disable(i2c);

#ifndef CONFIG_I2C_RTIO
#if defined(I2C_CR1_SMBUS) || defined(I2C_CR1_SMBDEN) || defined(I2C_CR1_SMBHEN)
	i2c_stm32_set_smbus_mode(dev, data->mode);
#endif
#endif /* CONFIG_I2C_RTIO */

	ret = i2c_stm32_configure_timing(dev, i2c_clock);
	if (ret < 0) {
		return ret;
	}

#ifndef CONFIG_I2C_RTIO
	if (data->smbalert_active) {
		LL_I2C_Enable(i2c);
	}
#endif /* CONFIG_I2C_RTIO */

#ifdef CONFIG_PM_DEVICE_RUNTIME
	ret = clock_control_off(clk, (clock_control_subsys_t)&cfg->pclken[0]);
	if (ret < 0) {
		LOG_ERR("failure disabling I2C clock");
		return ret;
	}
#endif

	return 0;
}

#ifdef CONFIG_I2C_STM32_BUS_RECOVERY
static void i2c_stm32_bitbang_set_scl(void *io_context, int state)
{
	const struct i2c_stm32_config *config = io_context;

	gpio_pin_set_dt(&config->scl, state);
}

static void i2c_stm32_bitbang_set_sda(void *io_context, int state)
{
	const struct i2c_stm32_config *config = io_context;

	gpio_pin_set_dt(&config->sda, state);
}

static int i2c_stm32_bitbang_get_sda(void *io_context)
{
	const struct i2c_stm32_config *config = io_context;

	return gpio_pin_get_dt(&config->sda) == 0 ? 0 : 1;
}

int i2c_stm32_recover_bus(const struct device *dev)
{
	__maybe_unused struct i2c_stm32_data *data = dev->data;
	const struct i2c_stm32_config *config = dev->config;
	struct i2c_bitbang bitbang_ctx;
	struct i2c_bitbang_io bitbang_io = {
		.set_scl = i2c_stm32_bitbang_set_scl,
		.set_sda = i2c_stm32_bitbang_set_sda,
		.get_sda = i2c_stm32_bitbang_get_sda,
	};
	uint32_t device_config = data->dev_config;
	int error = 0;
	int ret2;

	LOG_ERR("attempting to recover bus");

	if ((config->scl.port == NULL) || (config->sda.port == NULL)) {
		LOG_ERR("SCL and/or SDA GPIO definition(s) missing for I2C bus recovery");
		return -ENOSYS;
	}

	if (!gpio_is_ready_dt(&config->scl)) {
		LOG_ERR("SCL GPIO device not ready");
		return -EIO;
	}

	if (!gpio_is_ready_dt(&config->sda)) {
		LOG_ERR("SDA GPIO device not ready");
		return -EIO;
	}

#ifndef CONFIG_I2C_RTIO
	k_sem_take(&data->bus_mutex, K_FOREVER);
#endif

	error = gpio_pin_configure_dt(&config->scl, GPIO_OUTPUT_HIGH);
	if (error != 0) {
		LOG_ERR("failed to configure SCL GPIO (err %d)", error);
		goto restore;
	}

	error = gpio_pin_configure_dt(&config->sda, GPIO_OUTPUT_HIGH);
	if (error != 0) {
		LOG_ERR("failed to configure SDA GPIO (err %d)", error);
		goto restore;
	}

	i2c_bitbang_init(&bitbang_ctx, &bitbang_io, (void *)config);

	/* Use Fast speed (highest supported by bitbang) if not standard speed (bitbang default) */
	switch (I2C_SPEED_GET(device_config)) {
	case I2C_SPEED_STANDARD:
		break;
	case I2C_SPEED_DT:
		if (config->bitrate == I2C_BITRATE_STANDARD) {
			break;
		}
		__fallthrough;
	default:
		error = i2c_bitbang_configure(&bitbang_ctx, I2C_SPEED_SET(I2C_SPEED_FAST));
		if (error != 0) {
			LOG_ERR("failed to configure I2C bitbang (err %d)", error);
			goto restore;
		}
	}

	error = i2c_bitbang_recover_bus(&bitbang_ctx);
	if (error != 0) {
		LOG_ERR("failed to recover bus (err %d)", error);
	}

restore:
	ret2 = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret2 != 0) {
		return (error != 0) ? error : ret2;
	}

	/* Re-initialize the I2C peripheral after GPIO-based bus recovery.
	 * pinctrl_apply_state() restores the pin configuration, but the
	 * peripheral registers remain in a faulted state. Re-running
	 * runtime_configure() restores the peripheral to a working state.
	 */
	ret2 = i2c_stm32_runtime_configure(dev, device_config);
	if (ret2 != 0) {
		LOG_ERR("failed to restore I2C peripheral after bus recovery: %d", ret2);
		if (error == 0) {
			return ret2;
		}
	}

#ifndef CONFIG_I2C_RTIO
	k_sem_give(&data->bus_mutex);
#endif

	return error;
}
#endif /* CONFIG_I2C_STM32_BUS_RECOVERY */

/* I2C instances definitions */

#ifdef CONFIG_I2C_STM32_V2_DMA

#define I2C_DMA_INIT(index, dir)								\
	.dir##_dma = {										\
		.dev_dma = COND_CODE_1(DT_INST_DMAS_HAS_NAME(index, dir),			\
				(DEVICE_DT_GET(STM32_DT_INST_DMA_CTLR(index, dir))), (NULL)),	\
		.dma_channel = COND_CODE_1(DT_INST_DMAS_HAS_NAME(index, dir),			\
				(DT_INST_DMAS_CELL_BY_NAME(index, dir, channel)), (-1)),	\
	},

void i2c_stm32_dma_tx_cb(const struct device *dma_dev __unused, void *user_data __unused,
			 uint32_t channel __unused, int status)
{
	/* log DMA TX error */
	if (status != 0) {
		LOG_ERR("DMA error %d", status);
	}
}

void i2c_stm32_dma_rx_cb(const struct device *dma_dev __unused, void *user_data __unused,
			 uint32_t channel __unused, int status)
{
	/* log DMA RX error */
	if (status != 0) {
		LOG_ERR("DMA error %d", status);
	}
}

#define I2C_DMA_DATA_INIT(index, dir, src, dest)						\
	IF_ENABLED(DT_INST_DMAS_HAS_NAME(index, dir),						\
		(.dma_##dir##_cfg = {								\
			.dma_slot = STM32_DT_INST_DMA_SLOT(index, dir, slot),			\
			.channel_direction = STM32_DMA_CONFIG_DIRECTION(			\
				STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),			\
			.cyclic =  STM32_DMA_CONFIG_CYCLIC(					\
				STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),			\
			.channel_priority = STM32_DMA_CONFIG_PRIORITY(				\
				STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),			\
			.source_data_size = STM32_DMA_CONFIG_##src##_DATA_SIZE(			\
				STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),			\
			.dest_data_size = STM32_DMA_CONFIG_##dest##_DATA_SIZE(			\
				STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),			\
			/* single transfers (burst length = data size) */			\
			.source_burst_length = STM32_DMA_CONFIG_##src##_DATA_SIZE(		\
				STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),			\
			.dest_burst_length = STM32_DMA_CONFIG_##dest##_DATA_SIZE(		\
				STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),			\
			.dma_callback = i2c_stm32_dma_##dir##_cb,				\
		},))

#else /* CONFIG_I2C_STM32_V2_DMA */

#define I2C_DMA_INIT(index, dir)
#define I2C_DMA_DATA_INIT(index, dir, src, dest)

#endif /* CONFIG_I2C_STM32_V2_DMA */

#define I2C_STM32_INIT(index)									\
	I2C_STM32_IRQ_HANDLER_DECL(index);							\
												\
	IF_ENABLED(DT_HAS_COMPAT_STATUS_OKAY(st_stm32_i2c_v2), (				\
	static const uint32_t i2c_timings_##index[] = DT_INST_PROP_OR(index, timings, {});	\
	))											\
												\
	PINCTRL_DT_INST_DEFINE(index);								\
												\
	static const struct stm32_pclken pclken_##index[] = STM32_DT_INST_CLOCKS(index);	\
												\
	static const struct i2c_stm32_config i2c_stm32_cfg_##index = {				\
		.i2c = (I2C_TypeDef *)DT_INST_REG_ADDR(index),					\
		.pclken = pclken_##index,							\
		.pclk_len = DT_INST_NUM_CLOCKS(index),						\
		I2C_STM32_IRQ_HANDLER_FUNCTION(index)						\
		.bitrate = DT_INST_PROP(index, clock_frequency),				\
		.transfer_timeout = I2C_DT_INST_TRANSFER_TIMEOUT(index),			\
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),					\
		IF_ENABLED(CONFIG_I2C_STM32_BUS_RECOVERY, (					\
		.scl = GPIO_DT_SPEC_INST_GET_OR(index, scl_gpios, {0}),				\
		.sda = GPIO_DT_SPEC_INST_GET_OR(index, sda_gpios, {0}),				\
		))										\
		IF_ENABLED(DT_HAS_COMPAT_STATUS_OKAY(st_stm32_i2c_v2), (			\
		.timings = (const struct i2c_config_timing *)i2c_timings_##index,		\
		.n_timings = sizeof(i2c_timings_##index) / (sizeof(struct i2c_config_timing)),	\
		))										\
		I2C_DMA_INIT(index, tx)								\
		I2C_DMA_INIT(index, rx)								\
	};											\
												\
	IF_ENABLED(CONFIG_I2C_RTIO, (								\
		I2C_RTIO_DEFINE(CONCAT(_i2c, index, _stm32_rtio),				\
				DT_INST_PROP_OR(index, sq_size, CONFIG_I2C_RTIO_SQ_SIZE),	\
				DT_INST_PROP_OR(index, cq_size, CONFIG_I2C_RTIO_CQ_SIZE));	\
	))											\
												\
	static struct i2c_stm32_data i2c_stm32_dev_data_##index = {				\
		IF_ENABLED(CONFIG_I2C_RTIO, (							\
		.ctx = &CONCAT(_i2c, index, _stm32_rtio),					\
		))										\
		I2C_DMA_DATA_INIT(index, tx, MEMORY, PERIPHERAL)				\
		I2C_DMA_DATA_INIT(index, rx, PERIPHERAL, MEMORY)				\
	};											\
												\
	PM_DEVICE_DT_INST_DEFINE(index, i2c_stm32_pm_action);					\
												\
	I2C_DEVICE_DT_INST_DEFINE(index, i2c_stm32_init,					\
				  PM_DEVICE_DT_INST_GET(index),					\
				  &i2c_stm32_dev_data_##index,					\
				  &i2c_stm32_cfg_##index,					\
				  POST_KERNEL, CONFIG_I2C_INIT_PRIORITY,			\
				  &i2c_stm32_driver_api);					\
												\
	I2C_STM32_IRQ_HANDLER(index)

DT_INST_FOREACH_STATUS_OKAY(I2C_STM32_INIT)
